# TypeId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AlignmentStationLabelSetOptions..::..TypeId Property
AlignmentStationLabelSetOptions Class See Also
---
Specifies the ElementId of the labels' type. The default value is InvalidElementId. in this case, CreateSet(Alignment, View, AlignmentStationLabelSetOptions) will throw an exception.
**Namespace:** Autodesk.Revit.DB.Infrastructure**Assembly:** Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public ElementId TypeId { get; set; }
```

Visual Basic
---
```text
Public Property TypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Remarks
Recommended types can be found using IsRecommendedTypeForSet(Element) Other valid types can be found using IsValidType(Element).
# See Also
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace